-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-06-10 10:28:14
-- 伺服器版本： 10.4.25-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `fteam`
--

-- --------------------------------------------------------

--
-- 資料表結構 `lesson`
--

CREATE TABLE `lesson` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `info` varchar(255) NOT NULL,
  `categories_id` int(11) DEFAULT NULL,
  `duringtime_begin` date NOT NULL,
  `duringtime_end` date NOT NULL,
  `number_of_people` int(255) NOT NULL,
  `price` int(255) NOT NULL,
  `teacher` varchar(255) NOT NULL,
  `location` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `lesson`
--

INSERT INTO `lesson` (`sid`, `name`, `info`, `categories_id`, `duringtime_begin`, `duringtime_end`, `number_of_people`, `price`, `teacher`, `location`, `created_at`, `updated_at`) VALUES
(1, '((G) I-DLE) My Bag (MVdance)', '俗話說的好，掌握思考過程，也就掌握了街舞。我認為，我想，把街舞的意義想清楚，對各位來說並不是一件壞事。這必定是個前衛大膽的想法。\r\n\r\n', 0, '2022-06-05', '2022-07-05', 8, 3000, '小ㄗ', '台北市信義區', '2022-06-01 08:40:20', '2022-06-10 14:05:21'),
(2, '流行熱門舞蹈課程(單堂無進度)', ' 總結來說，跳舞可以說是有著成為常識的趨勢。諸葛亮曾經提到過，少壯不努力，老大徒傷悲。才須學也，非學無以廣才，非志無以成學。這句話幾乎解讀出了問題的根本。', 0, '2022-07-31', '2022-08-31', 5, 2250, '小雞', '台北市北投區', '2022-06-01 09:48:46', '2022-06-10 14:05:13'),
(3, 'New Jazz 基礎爵士(單堂無進度)', '土光敏夫曾經說過，風險和利益的大小是成正比的。但願各位能從這段話中獲得心靈上的滋長。透過逆向歸納，得以用最佳的策略去分析跳舞。', 0, '2022-06-16', '2022-07-16', 6, 2500, '圈圈', '台北市大安區', '2022-06-01 09:52:50', '2022-06-10 14:05:04'),
(4, 'Jessi - Zoom (MVdance)', ' 帶著這些問題，我們一起來審視跳舞。一般來說，我們不得不相信，奧弗伯里說過一句富有哲理的話，一個除了榮耀的祖先而一無所有的人，就像一個土豆唯一適合他的地方就泥地下面。這把視野帶到了全新的高度。', 0, '2022-06-10', '2022-07-10', 6, 3000, '小佑', '台北市松山區', '2022-06-01 09:55:51', '2022-06-10 14:04:56'),
(5, 'GIDLE - TOMBOY (MVdance)', ' 跳舞對我來說有著舉足輕重的地位，必須要嚴肅認真的看待。我們都有個共識，若問題很困難，那就勢必不好解決。了解清楚跳舞到底是一種怎麼樣的存在，是解決一切問題的關鍵。', 1, '2022-07-14', '2022-08-14', 5, 3000, '大壯', '台北市中正區', '2022-06-01 09:58:41', '2022-06-10 14:04:50'),
(6, '基礎嘻哈爵士 Jazz HIPHOP (單堂無進度)', '  街舞絕對是史無前例的。生活中，若街舞出現了，我們就不得不考慮它出現了的事實。謹慎地來說，我們必須考慮到所有可能。', 1, '2022-07-24', '2022-08-24', 5, 2250, '小ㄗ', '台北市信義區', '2022-06-01 10:06:46', '2022-06-10 14:04:43'),
(7, '新手Jazz爵士入門(適合真正零基礎)', '        所謂街舞，關鍵是街舞需要如何解讀。諸葛亮講過，士之相知，溫不增華，寒不改葉，能四時而不衰，歷夷險而益固。這段話的餘韻不斷在我腦海中迴盪著。\r\n\r\n', 1, '2022-07-01', '2022-08-01', 5, 2250, '小雞', '台北市北投區', '2022-06-01 10:10:14', '2022-06-10 14:04:36'),
(8, 'POPPING街舞', '        街舞勢必能夠左右未來。動機，可以說是最單純的力量。生活中，若街舞出現了，我們就不得不考慮它出現了的事實。我們要學會站在別人的角度思考。\r\n\r\n', 1, '2022-06-28', '2022-07-28', 6, 2500, '圈圈', '台北市大安區', '2022-06-01 10:18:02', '2022-06-10 14:04:27'),
(9, 'Breaking街舞體驗', '儘管街舞看似不顯眼，卻佔據了我的腦海。蒙田曾說過一句意義深遠的話，各市有各市的風俗，各鄉有各鄉的。這段話非常有意思。\r\n\r\n', 0, '2022-07-09', '2022-08-09', 6, 3000, '小佑', '台北市松山區', '2022-06-01 10:28:35', '2022-06-10 14:04:05'),
(10, 'LA STYLE - TBC舞蹈', '        白哲特在不經意間這樣說過，堅強的信念能贏得強者的心，並使他們變得更堅強。。這不禁令我重新仔細的思考。白哲特說過一句很有意思的話，堅強的信念能贏得強者的心，並使他們變得更堅強。這段話讓我的心境提高了一個層次。街舞的出現，重寫了人生的意義。\r\n\r\n', 1, '2022-06-19', '2022-07-19', 8, 3000, '大壯', '台北市中正區', '2022-06-01 10:32:15', '2022-06-10 14:03:31'),
(11, 'LISA - MONEY', '馬克思在過去曾經講過，科學絕不是一種自私自利的享受。有幸能夠致力於科學研究的人，首先應該拿自己的學識為人類服務。強烈建議大家把這段話牢牢記住。若到今天結束時我們都還無法釐清街舞的意義，那想必我們昨天也無法釐清。', NULL, '2022-06-20', '2022-07-26', 10, 2500, '小雞', '台北市北投區', '2022-06-08 11:37:06', '2022-06-10 16:12:23'),
(12, 'J Balvin - Blanco', '赫茲里特曾提出，小人物在社會中是一種必要的調劑。這類角色是極端令人愉快的，甚至會受人寵愛如果他們滿足於自己不得不扮演的角色。希望大家實際感受一下這段話。街舞似乎是一種巧合，但如果我們從一個更大的角度看待問題，這似乎是一種不可避免的事實。', NULL, '2022-06-27', '2022-07-27', 6, 2500, '圈圈', '台北市大安區', '2022-06-10 16:13:31', '2022-06-10 16:13:31'),
(13, 'B.I - BTBT', '        康有為說過一句經典的名言，虛驕自大者敗之媒，卑飛使用翼者擊之漸。想必各位已經看出了其中的端倪。街舞必定會成為未來世界的新標準。\r\n\r\n', NULL, '2022-07-13', '2022-08-31', 5, 2250, '小佑', '台北市松山區', '2022-06-10 16:14:43', '2022-06-10 16:14:43'),
(14, 'Saweetie - Best Friend', '我想，把街舞的意義想清楚，對各位來說並不是一件壞事。看看別人，再想想自己，會發現問題的核心其實就在你身旁。儘管街舞看似不顯眼，卻佔據了我的腦海。', NULL, '2022-07-20', '2022-08-10', 6, 3000, '大壯', '台北市中正區', '2022-06-10 16:15:53', '2022-06-10 16:15:53'),
(15, 'Anitta - Tócame', ' 對我個人而言，街舞不僅僅是一個重大的事件，還可能會改變我的人生。面對如此難題，我們必須設想周全。街舞因何而發生？', NULL, '2022-08-10', '2022-08-30', 10, 3000, '小ㄗ', '台北市信義區', '2022-06-10 16:16:54', '2022-06-10 16:16:54'),
(16, 'PRETTYMUCH - Rock Witchu', ' 街舞究竟是怎麼樣的存在，始終是個謎題。若發現問題比我們想像的還要深奧，那肯定不簡單。\r\n不難發現，問題在於該用什麼標準來做決定呢？', NULL, '2022-07-07', '2022-08-17', 7, 2000, '小雞', '台北市松山區', '2022-06-10 16:21:42', '2022-06-10 16:21:42'),
(17, 'Rema - Soundgasm', '巴爾扎克說過一句著名的話，痛苦跟歡樂一樣，會創造一種氣氛的。走進人家的屋子，你第一眼就可以知道它的基調是什麼，是愛情還是絕望。強烈建議大家把這段話牢牢記住。既然如此，現在，正視街舞的問題，是非常非常重要的。因為，巴金曾經說過，發達的科學技術是應當用來造福人類的，原子能應當為人類的進步服務。這段話雖短，卻足以改變人類的歷史。', NULL, '2022-08-03', '2022-09-20', 5, 2000, '圈圈', '台北市信義區', '2022-06-10 16:22:54', '2022-06-10 16:22:54'),
(18, 'BLACKPINK - Lovesick Girls', ' 若能夠欣賞到街舞的美，相信我們一定會對街舞改觀。不要先入為主覺得街舞很複雜，實際上，街舞可能比你想的還要更複雜。', NULL, '2022-07-14', '2022-08-24', 10, 3000, '小ㄗ', '台北市信義區', '2022-06-10 16:24:06', '2022-06-10 16:24:06'),
(19, 'Dr. Dre - The Next Episode', '那麼，我們不得不面對一個非常尷尬的事實，那就是，街舞對我來說有著舉足輕重的地位，必須要嚴肅認真的看待。我們可以很篤定的說，這需要花很多時間來嚴謹地論證。', NULL, '2022-07-06', '2022-08-18', 6, 2250, '小佑', '台北市松山區', '2022-06-10 16:24:51', '2022-06-10 16:24:51'),
(20, 'Lizzo - About Damn Time', '馬克思說過一句富有哲理的話，最好是把真理比作燧石——它受到的敲打越厲害，發射出的光輝就越燦爛。這句話幾乎解讀出了問題的根本。總而言之，面對如此難題，我們必須設想周全。街舞的出現，必將帶領人類走向更高的巔峰。', NULL, '2022-08-11', '2022-09-20', 8, 2000, '圈圈', '台北市大安區', '2022-06-10 16:25:41', '2022-06-10 16:25:41');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `lesson`
--
ALTER TABLE `lesson`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `lesson`
--
ALTER TABLE `lesson`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
